import type { ScaleForm } from '../../src/components/Scales/types'

export const breakUp: ScaleForm = {
  type: 'ordinal',
  config: {
    degree: ['完全不同意', '有些不同意', '中立', '有些同意', '完全同意'],
    defaultDegree: 3,
  },
  content: [
    {
      title: '我相信，只要不伤害他人，所有的生活方式都是正确的，都是好的',
    },
    {
      title: '人确有优劣之分，有的人比另一些人更有价值',
    },
    {
      title: '我其实只愿意遵守那些对我来说合情合理的法律和规则',
    },
    {
      title: '同性恋伴侣应拥有所有异性恋伴侣的权利，包括收养权',
    },
    {
      title: '人类只有两种性别',
    },
    {
      title: '安乐死应该合法化',
    },
    {
      title: '婚外性行为非常不道德',
    },
    {
      title: '卖淫应该合法化',
    },
    {
      title: '婚前性行为没有问题',
    },
    {
      title: '处女/处男情节没有问题',
    },
    {
      title: '动物保护法没有必要',
    },
    {
      title: '只要不在公众散布图片/视频,虐待动物就不应被法律制裁',
    },
    {
      title: '高学历人群的平均素质要高于低学历人群',
    },
    {
      title: '国家应该强制实施配额法令，要求父亲和母亲享有大致相等的育婴假',
    },
    {
      title: '一般来说，女人比男人更善良',
    },
    {
      title: '如果女性统治世界，暴力和战争会比现在少',
    },
    {
      title: '彩礼是合理的存在',
    },
    {
      title: '吃猫狗的肉就像和吃其他动物一样,不应被道德谴责或法律禁止',
    },
    {
      title: '我国已基本实现男女平等',
    },
    {
      title: '国家应该实施配额法令，规定一定比例的以男性为主导的高管职位应由女性担任',
    },
    {
      title: '社会平等比经济增长更重要',
    },
    {
      title: '政府运行的稳定比法制建设和公民自由更重要',
    },
    {
      title: '纳税人的钱应该少花在艺术上',
    },
    {
      title: '在某些案例中，我认为法官应判罪犯死刑(事实并没有判死刑)',
    },
    {
      title: '政府规划项目，浪费现象颇多',
    },
    {
      title: '应尽量减少并严格控制到我国的移民',
    },
  ],
}
